/**
 * Created by Lobseer on 21.10.2016.
 */
public class Main {
}
/*
Привет!

Высылаю в качестве ознакомления задание на сегодня.
1) интерфейсы не менять
2) реализовать классы и добавить создание обьектов в мейн

Тема - Экзамен
Базовые компоненты - тема и вопрос. Каждый вопрос содержит тему, название (сам вопрос в текстовом виде), варианты ответа в текстовом виде и правильные ответы в виде списка индексов из вариантов ответов.
Тест - набор вопросов + порядкой номер теста.
Результат теста - тсатистика по правльно отвеченым и неправильно отвеченым вопросам.
Сервис - логика обработки теста и предоставленных ответов.

Вопрос
    - название
    - тема
    - варианты ответа
    - правильные варианты ответа
Тема
    - название
    - описание
Тест
    - номер
    - вопросы
    - правильные ответы(только номера ответов)
Результаты теста
    - количество правильных ответов
    - количество вопросов
    - количество неправильных ответов
 Сервис
    - создать произвольный тест
    - добавить вопрос
    - провести тест(передаем тест, и ответы выдаем результат)
 */
